Revit 2027 API
BuiltInFailures.StairRampFailures.StringerCurveTooShort Property
 A piece of boundary is too short to create stringer on it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StringerCurveTooShort { get; }
Public Shared ReadOnly Property StringerCurveTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StringerCurveTooShort {
	FailureDefinitionId^ get ();
}
static member StringerCurveTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace